; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	spectrograph5 - mode
	image6 - mode
	thermograph3 - mode
	infrared4 - mode
	spectrograph0 - mode
	image2 - mode
	infrared7 - mode
	GroundStation0 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	GroundStation1 - direction
	Star2 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 image6)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared1)
	(supports instrument2 infrared7)
	(supports instrument2 image6)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument3 image2)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 Star4)
	(supports instrument4 image2)
	(supports instrument4 infrared7)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument5 infrared7)
	(supports instrument5 infrared4)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph3)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star2)
	(supports instrument7 image2)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument8 spectrograph5)
	(supports instrument8 infrared4)
	(calibration_target instrument8 Star5)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph3)
	(supports instrument10 infrared7)
	(supports instrument10 spectrograph5)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
)
(:goal (and
	(pointing satellite2 Planet7)
	(pointing satellite3 Star3)
	(pointing satellite4 Star4)
	(have_image Planet6 image6)
	(have_image Planet6 infrared1)
	(have_image Planet7 image2)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon9 infrared7)
	(have_image Planet10 spectrograph0)
	(have_image Planet10 infrared1)
))

)

; plan
1. (turn_to satellite3 star3 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star3)
   goals met: 1 of 11
2. (turn_to satellite2 star4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star4)
   goals met: 1 of 11
3. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 11
4. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 1 of 11
5. (turn_to satellite2 star8 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star8)
   goals met: 1 of 11
6. (take_image satellite2 star8 instrument3 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 2 of 11
7. (turn_to satellite2 planet10 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet10)
   goals met: 2 of 11
8. (take_image satellite2 planet10 instrument3 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 11
9. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 11
10. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 3 of 11
11. (take_image satellite2 phenomenon9 instrument3 image2)
   added: (have_image phenomenon9 image2)
   goals met: 4 of 11
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 11
13. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 4 of 11
14. (turn_to satellite1 phenomenon9 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 11
15. (take_image satellite1 phenomenon9 instrument2 infrared7)
   added: (have_image phenomenon9 infrared7)
   goals met: 5 of 11
16. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 5 of 11
17. (take_image satellite1 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 6 of 11
18. (turn_to satellite1 planet6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet6)
   goals met: 6 of 11
19. (take_image satellite1 planet6 instrument2 image6)
   added: (have_image planet6 image6)
   goals met: 7 of 11
20. (take_image satellite1 planet6 instrument2 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 8 of 11
21. (turn_to satellite2 planet7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet7)
   goals met: 9 of 11
22. (take_image satellite2 planet7 instrument3 image2)
   added: (have_image planet7 image2)
   goals met: 10 of 11
23. (turn_to satellite4 star4 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star4)
   goals met: 11 of 11
